WcfHarness/WcfHarness/RequestXmls/GetDirectories_ByName.xml

<?xml version="1.0" encoding="utf-8" ?>
<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Body>
    <GetDirectories xmlns="http://www.tavisca.com/Vexiere/IDirectory/2013/01">
      <getDirectoriesRequest xmlns:a="http://schemas.datacontract.org/2004/07/Tavisca.Vexiere.DataContract" xmlns:i="http://www.w3.org/2001/XMLSchema-instance">
        <a:AdditionalData i:nil="true"/>
        <a:FilterParameters>
          <a:FilterParameter>
            <a:SearchOn>Name</a:SearchOn>
            <a:SearchOperator>EqualTo</a:SearchOperator>
            <a:SearchValue i:type="a:TextValue">
              <a:Value>7c62b763-6d12-41a0-926a-ed4973b8aade</a:Value>
            </a:SearchValue>
          </a:FilterParameter>
        </a:FilterParameters>
        <a:PagingInfo i:nil="true"/>
        <a:SearchScope>
          <a:OrganizationIdentifier>
            <a:Id>1</a:Id>
          </a:OrganizationIdentifier>
      </a:SearchScope>
        <a:SortingInfo i:nil="true"/>
      </getDirectoriesRequest>
    </GetDirectories>
  </s:Body>
</s:Envelope>